The  DocumentSynchronizedWithCentralEventArgs  type exposes the following members.
 Properties
Name  |   Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from  RevitAPIEventArgs  .)
Document
 The document associated with the event.
 (Inherited from  RevitAPIPostDocEventArgs  .)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  RevitAPIEventArgs  .)
Status
 Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
 (Inherited from  RevitAPIPostEventArgs  .)
 See Also
  DocumentSynchronizedWithCentralEventArgs Class
  Autodesk.Revit.DB.Events Namespace